jpan127/LPC17XX-Drivers/firmware/default/applications/CMPE146/L5_Application/labs/Switch2LedTask.cpp
#include <stdio.h>
#include "LPC17xx.h"
#include "scheduler_task.hpp"
#include "task.h"
#include "L5_Application/drivers/gpio_output.hpp"
#include "L5_Application/drivers/buttons.hpp"
#include "L5_Application/drivers/led.hpp"

#define LED_PORT (GPIO_PORT0)
#define LED_PIN  (1)

// Controls an led, on/off, by 2 button switches
class Switch2LedTask : public scheduler_task
{
public:

	Switch2LedTask(uint8_t priority) : 
										scheduler_task("Switch2LedTask", 2048, priority),
										Led(LED_PORT, LED_PIN)
	{
		printf("[Switch2LedTask] Pins are set up.\n");
		Led.SetLow();
	}

	bool run(void *p)
	{	
		// Turn on LED when SW0 is pressed.
		if (Button0::getInstance().IsPressed()) {
			Led0::getInstance().SetLed();
			Led.SetHigh();
			printf("[Switch2LedTask] SW0, turning on LED.\n");
		}

		// Turn off LED when SW1 is pressed.
		else if (Button1::getInstance().IsPressed()) {
			Led1::getInstance().SetLed();
			Led.SetLow();
			printf("[Switch2LedTask] SW1, turning off LED.\n");
		}

		// Free CPU for context switching
		vTaskDelay(100);

		return true;
	}

private:

	// Gpio P0.1
	GpioOutput 	Led;
};